app/views/users/_info.html.erb

	  <th>投稿数</th>
	  <th><%= user.plans.count %>件</th>
---
SELECT COUNT(*) FROM "plans" WHERE "plans"."user_id" = ?  [["user_id", 1]]