app/views/users/show.html.erb

SELECT "plans".* FROM "plans" WHERE "plans"."user_id" = ?  [["user_id", 1]]
---
<% @favorites.each do |favorite| %>
<% plan = Plan.find_by(id: favorite.plan.id) %>