app/controllers/plans_controller.rb

  def index
    @plan = Plan.all
    @new_plan = Plan.page(params[:page]).reverse_order
---
SELECT "plans".* FROM "plans"
SELECT  "plans".* FROM "plans" ORDER BY "plans"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]