app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "plans".* FROM "plans" WHERE "plans"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @plan = @user.plans
    @favorites = Favorite.where(user_id: @user.id)