app/views/plans/index.html.erb

SELECT "plans".* FROM "plans"
---

　　　　　　<!--<p><= link_to "#{plan.plan_comments.count} コメント", plan_path(plan.id) %></p>-->